Table: Employee

+-------------+------+
| Column Name | Type |
+-------------+------+
| id          | int  |
| salary      | int  |
+-------------+------+
id is the primary key (column with unique values) for this table.
Each row of this table contains information about the salary of an employee.
 

Write a solution to find the second highest salary from the Employee table. If there is no second highest salary, return null (return None in Pandas).

The result format is in the following example.

 

Example 1:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
Output: 
+---------------------+
| SecondHighestSalary |
+---------------------+
| 200                 |
+---------------------+
Example 2:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
+----+--------+
Output: 
+---------------------+
| SecondHighestSalary |
+---------------------+
| null                |
+---------------------+

In [1]:
import pandas as pd

def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    if((employee.shape[0] == 1) | (len(employee.salary.unique()) == 1)):
        return(pd.DataFrame([pd.NA], columns = ['SecondHighestSalary']))
    else:
        return(pd.DataFrame([sorted(list(set(employee.salary.to_list())), reverse = True)[1]], columns=['SecondHighestSalary']))

In [2]:
data = [[1, 100], [2, 200], [3, 300]]
df1 = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})
df1

   id  salary
0   1     100
1   2     200
2   3     300

In [3]:
second_highest_salary(df1)

   SecondHighestSalary
0                  200